Revit 2024 API
MacroManager.IsEnabled Property
 Indicates if macros stored in this MacroManager are enabled.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsEnabled { get; }
Visual Basic
Public ReadOnly Property IsEnabled As Boolean
	Get
Visual C++
public:
property bool IsEnabled {
	bool get ();
}
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace